constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    aerofoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       31760;
    }
    inlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          200;
        startFace       31880;
    }
    outlet
    {
        type            patch;
        inGroups        List<word> 1(freestream);
        nFaces          160;
        startFace       32080;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          16000;
        startFace       32240;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          16000;
        startFace       48240;
    }
)

// ************************************************************************* //
